<!DOCTYPE html>

<html>
    <head>
        <meta charset="UTF-8">
        <title>Ejercicio 3.2</title>
    </head>
    
    <body>
        <li><a href = "../../index.html" target = "_self">
            <strong>Inicio</strong></a></li>
        <h2>Ejercicios de autoevaluaci&oacute;n</h2>
        <hr>
        <p><strong>3.2</strong> Indique si cada uno de los siguientes enunciados es <em>verdadero</em> o <em>falso</em>. Si es <em>falso</em>, explique por qu&eacute;. <br>
            &nbsp;&nbsp;&nbsp;&nbsp;a) Cualquier tipo de input particular de formulario de HTML5 debe desplegarse de manera id&eacute;ntica en todos los navegadores compatibles con HTML5. <em>Falso</em>. El despliegue
            de los tipos input puede variar de un navegador a otro.<br>
            &nbsp;&nbsp;&nbsp;&nbsp;b) Cuando se coloca el enfoque em el campo de texto (es decir, si el cursor est&aacute; en el campo de texto), se env&iacute; el texto del atributo
            placeholder al servidor. <em>Falso</em>. Cuando se coloca el enfoque en el campo de texto, el texto de palceholder desaparece. No se "env&iacute;a" cuando el usuario hace clic en el bot&oacute;n 
            <strong>Enviar</strong> (a menos que el usuario escriba el mismo texto). <br>
            &nbsp;&nbsp;&nbsp;&nbsp;c) No es necesario incluir el atributo autofocus en sus formularios. <em>Verdadero</em>. <br>
            &nbsp;&nbsp;&nbsp;&nbsp;d) Los nuevos tipos de input de HTML5 tienen validaci&oacute;n autom&aacute;tica del lado del cliente, con lo cual se elimina la necesidad de agregar secuencias
            de comandos (script) complicadas a sus formularios para validar la entrada del usuario y se reduce la cantidad de datos inv&aacute;lidos que se env&iacute;n. <em>Verdadero</em>. <br>
            &nbsp;&nbsp;&nbsp;&nbsp;e) El tipo input range se valida autom&aacute;ticamente de manera intr&iacute;nseca cuando el navegador lo despliega como un control deslizante, ya que el usuario no puede
            mover el control fuera de los l&iacute;mites del valor m&iacute;nimo o m&aacute;ximo. <em>Verdadero</em>. <br>
            &nbsp;&nbsp;&nbsp;&nbsp;f) HTML5 cuenta con validadci&oacute;n autom&aacute;tica para el tipo input tel. <em>Falso</em>. La longitud y el formato
            de los n&uacute;meros telef&oacute;nicos var&iacute; de manera considerable con base en la ubicaci&oacute;n, por lo que la validaci&oacute;n se vuelve bastante compleja, as&iacute; que HTML5 no cuenta con validaci&oacute;n
            autom&aacute;tica para el tipo input tel. Para asegurar que el usuari introduzca el n&uacute;mero en un formato apropiado, usamos el atributo pattern.<br>
            &nbsp;&nbsp;&nbsp;&nbsp;g) Si el usuario introduce un URL con un formato inapropiado en un tipo input url, no se validar&aacute;. HTML5 no valida si el URL introducido existe en realidad. <em>Verdadero</em>.<br>
            &nbsp;&nbsp;&nbsp;&nbsp;h) El elemnto nav muestra un men&uacute; desplegable de hiperv&iacute;nculos. <em>Falso</em>. El elemnto nav agrupa v&iacute;nculos de navegaci&oacute;n.<br>
            &nbsp;&nbsp;&nbsp;&nbsp;i) El elemnto header puede usuarse s&oacute;lo una vez en una p&aacute;gina. <em>Falso</em>. El elemento header puede usarse varias veces en una p&aacute;gina y a menudo incluye encabezados
            de HTML (h1 a h6).<br>
            &nbsp;&nbsp;&nbsp;&nbsp;j) Los elementos nav pueden anidarse en un elemento aside. <em>Verdadero</em>. <br>
            &nbsp;&nbsp;&nbsp;&nbsp;k) Podemos usar el elemento brk para evitar dividir palabras en lugares incorrecto. <em>Falso</em>. Puede usar el elmento wbr para evitar dividir las palabras en lugares incorrectos.
        </p>
    </body>
</html>